In [67]:
%matplotlib inline

# Data Frames

## Introduction

What is a DataFrame? a 2-D labeled data structure with columns of potentially different type.

![](dataframe.png)

This type of data should feel rather familiar to Excel or Stata users. It is also an elementary brick of "relational databases" which consist in several related dataframes (aka tables). There is a specialized language (SQL) to query this data bases. It is the defacto standard for database work.

![](relational_database.png)

### Pandas

[pandas](https://pandas.pydata.org/) is a python library providing a dataframe object (and Series which are columns of DataFrames). It was created by Wes McKinsey, and is a very optimized piece of software with many, many options. It features:

- handling of missing data
- automatic and explicit data alignment
- hierarchical labeling
- very fast IO

pandas implement:
- optimized operations (mean, sum, ...) with split/apply/combine semantics
- many slicing/indexing options
- intuitive merging/joinging of datasets
- flexible reshaping and pivoting of data sets

What is Pandas scope? intermediate size databases
- too small to require to learn sql
- in-memory computations

Alternatives for other tasks:
- xarray: multidimensional arrays with labelled dimensions
- dask: pandas-like syntax for out-of-memory operations.

Used with Pandas:
- odo: data conversion/import
- statsmodels: regression and statistics
- scikit-learn: machine learning
- matplotlib: plots

The number of options for a given task can be intimidating. We tend to follow the [minimially sufficient pandas](https://medium.com/dunder-data/minimally-sufficient-pandas-a8e67f2a2428), that is to us a small subset of available features, even if that means longer code.
There are tons of tutorials out there, including a 10 min introduction in pandas [doc](https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html). The handbook "Python for Data Analysis Book" is also highly recommended.

## Short primer

### Creation

#### By Hand

In [17]:
# from array

In [18]:
# from dictionary

In [19]:
# if columns are not alignes, one needs to use series

In [ ]:
# a data frame can be viewed as a record array, with additional index and columns informations
# they can be changed after the dataframe is created

#### From file

The following file formats map naturally to pandas DataFrames.

In [20]:
# csv file (check filetype and delimiters: comma-separated values can by separated, by... anything)
# read_csv

In [21]:
# stata

In [22]:
# xls (cf openpyxl)

#### From database

In [23]:
# from sql (cf sqlalchemy)

In [24]:
# from dbnomics (install using pip install dbnomics)

# try to import

In [ ]:
# import altair
# altair.datasets.list_datasets()

### Export

In [25]:
# .to_csv

In [26]:
# .to_xls

In [27]:
# pickle

### Basic manipulation

In [28]:
# .head
# .tail
# .describe
# .mean
# std

In [30]:
# groupby:
# groupby().fun()
# groupby().agg({'col':'fun'})

### Indexing, slicing

In [1]:
import altair
df = altair.datasets.load_dataset('us-employment')
df.head(5)

,month,nonfarm,private,goods_producing,service_providing,private_service_providing,mining_and_logging,construction,manufacturing,durable_goods,...,transportation_and_warehousing,utilities,information,financial_activities,professional_and_business_services,education_and_health_services,leisure_and_hospitality,other_services,government,nonfarm_change
0,2006-01-01,135450,113603,22467,112983,91136,656,7601,14210,8982,...,4420.0,549.8,3052,8307,17299,17946,12945,5425,21847,282
1,2006-02-01,135762,113884,22535,113227,91349,662,7664,14209,8986,...,4429.4,550.1,3052,8332,17365,17998,12980,5426,21878,312
2,2006-03-01,136059,114156,22572,113487,91584,669,7689,14214,9000,...,4429.7,547.5,3055,8348,17438,18045,13034,5425,21903,297
3,2006-04-01,136227,114308,22631,113596,91677,679,7726,14226,9020,...,4445.4,548.9,3046,8369,17462,18070,13074,5426,21919,168
4,2006-05-01,136258,114332,22597,113661,91735,681,7713,14203,9017,...,4459.4,548.3,3039,8376,17512,18100,13052,5433,21926,31

In [2]:
# index columns with brackets->resulting object is a Series
df['nonfarm'].head(4)

0    135450
1    135762
2    136059
3    136227
Name: nonfarm, dtype: int64

In [3]:
# index columns with loc: like indexing a 2d array
# note that extreme values of intervals are included !
df.loc[0:2,['month','nonfarm']]

        month  nonfarm
0  2006-01-01   135450
1  2006-02-01   135762
2  2006-03-01   136059

In [60]:
# index columns with lioc: like indexing a 2d array with integer values
# note that extreme values of intervals are included !
df.iloc[0:2,3:5]

   goods_producing  service_providing
0            22467             112983
1            22535             113227

### Combining, reshaping dataframes

In [4]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame({ 'A' : ['one', 'one', 'two', 'three'] * 3,
                    'B' : ['A', 'B', 'C'] * 4,
                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                    'D' : np.random.randn(12),
                    'E' : np.random.randn(12)})

In [6]:
df

        A  B    C         D         E
0     one  A  foo -0.479112  0.230533
1     one  B  foo  1.645694 -1.706140
2     two  C  foo -0.086042  1.314556
3   three  A  bar  0.843359 -0.136195
4     one  B  bar  0.191390 -0.116995
5     one  C  bar -0.563126 -0.084229
6     two  A  foo -2.139900  0.993571
7   three  B  foo -0.309535 -1.110011
8     one  C  foo -0.568572 -1.416767
9     one  A  bar -0.376776  1.757021
10    two  B  bar  1.021299 -0.267805
11  three  C  bar  1.626399 -1.017574

In [15]:
pt = pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])
pt

C             bar       foo
A     B
one   A -0.376776 -0.479112
      B  0.191390  1.645694
      C -0.563126 -0.568572
three A  0.843359       NaN
      B       NaN -0.309535
      C  1.626399       NaN
two   A       NaN -2.139900
      B  1.021299       NaN
      C       NaN -0.086042

In [16]:
# note that the result has special hierarchical indices (multindex)
# to get rid of them: .reset_index
pt.reset_index()

C      A  B       bar       foo
0    one  A -0.376776 -0.479112
1    one  B  0.191390  1.645694
2    one  C -0.563126 -0.568572
3  three  A  0.843359       NaN
4  three  B       NaN -0.309535
5  three  C  1.626399       NaN
6    two  A       NaN -2.139900
7    two  B  1.021299       NaN
8    two  C       NaN -0.086042

**Using MultiIndex to reorganize the information in a DataFrame**

In [5]:
dfi = df.set_index(['A','B','C'])

In [6]:
dfi

                    D         E
A     B C
one   A foo  0.042490 -0.043692
      B foo -0.120333 -0.281835
two   C foo  0.175495  0.580749
three A bar  0.039859 -0.541817
one   B bar -1.208724  0.182690
      C bar  0.225546 -1.200098
two   A foo -0.068632  1.329266
three B foo  1.978199 -0.750169
one   C foo -0.709990  0.745212
      A bar  0.328635 -2.024948
two   B bar -1.273351 -0.495985
three C bar  0.828350 -0.785491

In [71]:
dfi.unstack(level='C')

                D                   E
C             bar       foo       bar       foo
A     B
one   A -1.139532 -1.147829  0.092835  1.808482
      B  0.284371  0.367665 -0.052488  1.262942
      C -1.905237  0.074089  0.068501  1.597474
three A  0.569115       NaN -0.355622       NaN
      B       NaN -0.746973       NaN -0.796331
      C  0.612354       NaN -0.824024       NaN
two   A       NaN  1.363116       NaN -2.470829
      B  1.120662       NaN  0.202382       NaN
      C       NaN  1.412131       NaN  0.532147

In [72]:
dfi['D'].unstack(level='C')         #Same as the pivot table result

C             bar       foo
A     B
one   A -1.139532 -1.147829
      B  0.284371  0.367665
      C -1.905237  0.074089
three A  0.569115       NaN
      B       NaN -0.746973
      C  0.612354       NaN
two   A       NaN  1.363116
      B  1.120662       NaN
      C       NaN  1.412131

### Visualization

There are many options to visualize dataframe including:
- pandas plotting methods
- indexing+matplotlib
- altair

#### Altair

Altair is a python wrapper to the vega-lite language, which itself is an extension of grammar-of-graphics to allow for interactions.